Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId GridlinesOutOfBoundsWarn { get; }
  Visual Basic
Public Shared ReadOnly Property GridlinesOutOfBoundsWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ GridlinesOutOfBoundsWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace